// 1)შექმენით ერთი სეტი სადაც მოათავსებთ რამდენიმე ელემენტს(ერთნაირი ელემენტები მეორდებოდეს რამდენჯერმე)

// შენი დავალებაა რომ სეტში დაამატო რამდენიმე განსხვავებული ელემენტი(გამოიყენე CHAIN + მეთოდი)

// შემდეგ ამოშალე ის ელემენტი სეტიდან რომელიც პირველია სეტში

// შემდეგ შეამოწმე არის თუ არა თქვენთვის სასურველი ელემენტი სეტში

// შემდეგ კონსოლში გამოიტანე სეტის სიგრძე

// შემდეგ შექმენი ცვლადი და გამოიყენე ENTRIES მეთოდი სეტზე,ამის შემდეგ გადაუარე FOREACH ით და გამოიტანე წყვილად(სიებად)

// ამის შემდეგ გაასუფთავეთ მთლიანი სეტი


let set = new Set([1,2,2,1,5,5,7,8,5])


set.add(11).add(12).add(13)

set.delete(1)

console.log(set.has(2))
console.log(set.size)

let Ent = set.entries()

Ent.forEach(element => {
    console.log(element)
})

console.log(set.clear())
console.log(set)
