//Hyper text transfer protocol

//Get_გვეხმარება საიტიდან სერვერებიდან წამოვიღოთ ინპორმაცია
// Post _ გვეხმარება სერვერზე დავამატოთ ინპორმაცია
// Put_ გვეხმარება შევცვალოთ რაიმე ინპორმაცია საიტზე
// Delete_ გვეხმარება სერვერიდან წავშალოთ რაიმე ინფორმაცია

// 200_ ნიშნავს რომ ჩვენი მოთხოვნა წარმათებით დადასტურდა

// ნიშნავს რომ ჩვენი მოთხოვნა ვერ დადასტურდა

// ნიშნავს რომ რაღაც შეცდომაა და რაღაც გაფუჭდა ჩვნეს ბაქენდზე

//404 _ნიშავს რომ რაღაც ვერ მოიძებნა ჩვენ საიტზე


// სინქრონიზირებული კოდი ნიშნავს როდესაც ჩვენი კოდი ზემოდან ქვემოდ იკითხება

// არასინქრონიზირებული კოდი არის როდესაც კოდი არ იკითდხება მიყოლებით

// Request_ არის როდესაც რაიმე სერვერზე მოთხოვნა გვაქს გაგაზავნილი რაიმეს წამოსაღებად სერვერიდან