//შექმენი ფუნქცია, რომელიც იღებს რიცხვების სიას და აბრუნებს ახალ სიას
//მხოლოდ იმ რიცხვებისგან შემდგარს, რომლებიც ერთდროულად ლუწებიც 
//არიან და 5-ის ჯერადებიც,შემდეგ ამ სიაში მყოფი კენტი რიცხვების ჯამი იპოვეთ

function list(arr){
    let even = []
    let odd = 0
    for (let i = 0; i<arr.length;i++){
        if(arr[i] % 2 === 0 && arr[i] % 5 ===0){
            even.push(arr[i])
        }else{
            odd+=arr[i]
        }
    }
    console.log("5ის ჯერადი რიცხვები" + even)
    console.log("კენტი რიცხვების ჯამი" + odd)
}

list([5,20,25,345,10,50,241])