//შექმენით ფუნქცია რომელიც არგუმენტად იღებს ორ სიას(რიცხვების),
//თქვენი დავალებაა რომ იპოვოთ ორივე სიაში მყოფი რიცხვების ჯამი
//და შემდეგ შეადაროთ,თუ ამ ორი რიცხვის ჯამი მეტია 50 ზე და არის
//ლუწი მაშინ გამოიტანე შემდეგი ტექსტი --> "ორი რიცხვის ჯამი არის
//მაღალი და ეს რიცხვია ..." სხვა შემთხევაში გამოიტანეთ ---> 'ორი
//რიცხვის ჯამი არის ძალიან დაბალი და ეს რიცხვია ..."


function list(a, b) {
    sum1 = 0
    sum2 = 0
    for (let i = 0; i < a.length; i++) {
        sum1 += a[i]
    }
    for (let i = 0; i < b.length; i++) {
        sum1 += b[i]
    }
    let c = sum1 + sum2
    if(c > 50){
        console.log("ორი რიცხვის ჯამი არის მაღალი და ეს რიცხვია" + c)
    }else{
        console.log("ორირიცხვის ჯამი არის ძალიან დაბალი და ეს რიცხვია" + c)
    }
}

list([1, 32, 5], [2, 12, 43])