// 2)რა განსხვავებაა getElementById , getElementByClassName , getElementByTagName შორის დაწერე კომენტარის სახით და ახსენი ყველაფერი რაც იცი თითიეულ მათგანზე 


//getElementById_ დახმარებით შეგვიძლია მივწვდეთ ელემენტს HTML_ში და წამოვიღოთ JS მაგრამ ლისტის სახით არა

//getElementByClassName_ დახმარებით შეგვიძლია მივწვდეთ ელემენტს HTML_ში და წამოვიღოთ JS ყველა ერთნაირი კლასის მქონე ელემენტი ლისტის სახით

//getElementByTagName_ დახმარებით შეგვიძლია მივწვდეთ ელემენტს HTML_ში და წამოვიღოთ JS ყველა ის ელემენტი რომელიც ჩვენ გვინდა ლისტის სახით