/*
ლოგიკური ოპერატორები, რაც ვისწავლეთ:
1) &&  -> AND (მხოლოდ მაშინ აბრუნებს true-ს თუ ორივე პირობა მართალია)
2) ||  -> OR  (აბრუნებს true-ს თუ მაინც ერთი პირობა მართალია)
3) !   -> NOT (აბრუნებს პირობის საპირისპიროს)
*/


// === AND (&&) ===
console.log(5 > 3 && 10 > 7);
console.log(5 > 10 && 10 > 7);
console.log(2 === 2 && 3 === 3);
console.log(4 < 2 && 1 < 5);
console.log(8 > 5 && 9 < 20);


// === OR (||) ===
console.log(5 > 3 || 10 > 7);
console.log(5 > 10 || 10 > 7);
console.log(2 === 2 || 3 === 5);
console.log(4 < 2 || 1 < 0);
console.log(8 > 5 || 9 > 20);


// === NOT (!) ===
console.log(!(5 > 3));
console.log(!(5 < 3));
console.log(!(10 === 10));
console.log(!(7 !== 7));
console.log(!(2 > 5));


/*

==  მხოლოდ მნიშვნელობას ამოწმებს,
=== კი მნიშვნელობას + მონაცემის ტიპს.
*/