//)მომხმარებელს შემოატანინე რიამე რიცხვი 1იდან 10 მდე,თუ მომხმარებლის
// მიერ შემოტანილი რიცხვი არის ლუწი,მაგ შემთხვევაში დაატრიალეთ ფორ 
// ლუპი და ამ რიცხვიდან 50 მდე გამოიტანეთ ყველა ლუწი რიცხვი,და თუ 
// მომხმარებლის მიერ შემოტანილი რიცხვი არის კენტი,მაშინ დაატრიალეთ 
// WHILE LOOP ამ რიცხვიდან 50 მდე და გამოიტანეთ ყველა კენტი რიცხვი

let num = Number(prompt("შეიყვანე რიცხვი 1დან 10მდე "))
function evenodd() {
    let i = 0
    if (num % 2 == 0) {
       for (let i = num; i <= 50; i++) {
            if (i % 2 == 0) {
                console.log(i)
            }
        }

    } else {
        while (i != 50) {
            if (i % 2 != 0) {
                console.log(i)
            }
            i++
        }
    }

}
evenodd()