//მომხმარებელს შემოატანინეთ რიცხვი,შემდეგ დაატრუალეთ ფორ ციკლი 1 იდან
//მომხმარებლის მიერ შემოტანილ რიცხვამდე და იპოვე ამ რიცხვების საშუალო
//არითმეტიკული,შემდეგ შეამოწმეთ,თუ მიღებული საშვალო არის 20ზე მეტი 
//და ლუწი,მაშინ დააკონსოლლოგე რომ "good mark" შემდეგ შეამოწმეთ თ რს
//მიღებული საშვალო არის 20 ზე ნაკლები და კენტი დაუკონსოლლოგეთ --> 'very bad mark"


function func(){
    let num = Number(prompt("Enter your number; "))
    let sum = 0
    for(let i = 1; i < num; i++){
        sum +=i
    }
    let a = sum / num
    if(a > 20 && a % 2 == 0){
        console.log("good mark")
    }else{
        console.log("very bad mark")
    }

}

func()