// შექმენით ფრომისი რომელშიც

// შექმნით ცვლადს სადაც იქნება შენახული რაიმე სახელი

// შენი დავალებაა შეამოწმო თუ სახელი იწყება ასო "a" ზე ან ასო "g" ზე

// მაშინ დაარესოლვე ფრომისი და რესოლვს გაატანე ის სახელი რაც ცვლადში გაქვს შენახული

// სხვა შემთხვევაში დაარეჯექთე ფრომისი და ერორად გაატანე რაიმე ტექსტური ერორი

// , შემდეგ გამოიძახე ეს ფრომისი ისე რომ რეჯექთის და რესოლვის შემთხვევაშიც გამოიტანოს ის მნიშვნელობები რაც ფრომისმა გამოგვატანა 



let prom = new Promise((res,rej)=>{
    let name = "goga"

    name[0] === "g" || name[0] === "G" || name[0] === "a" || name[0] === "A"? res(name) : rej("სახელი არასწორია")
})


prom.then((resss)=>{
    console.log(resss)
},(rejjj)=>{
    console.log(rejjj)
})